building-matrices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-19 Sun 18:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Building matrices in C++</title>
<meta name="author" content="Amitav Krishna" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Building matrices in C++</h1>
<div id="outline-container-orgcad8d79" class="outline-2">
<h2 id="orgcad8d79"><span class="section-number-2">1.</span> Building matrices</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4d5d6b2" class="outline-3">
<h3 id="org4d5d6b2"><span class="section-number-3">1.1.</span> What the hell is a matrix, anyways?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
When I say matrix, you probably don't have a great idea of what a matrix actually <i>is</i>, and that's what I aim to solve.<br />
</p>
</div>
<div id="outline-container-org92db1b4" class="outline-4">
<h4 id="org92db1b4"><span class="section-number-4">1.1.1.</span> What the hell is a vector, <i>really</i>?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
<i>This section draws heavily on the textbook Linear Algebra Done Right by Sheldon Axler</i><br />
</p>

<p>
In the previous issue I didn't go that deeply into the mathematical defintion behind a vector. Sadly, before we can truly understand what a matrix is, we must first understand what a vector is.<br />
</p>

<p>
In grade school, you should have learned about \(\mathbb{Q}\), the rational numbers, \(\mathbb{Z}\), the integers, and most importantly for this discussion, \(\mathbb{R}\), the set of all real numbers. The <i>set of</i> the real numbers(\(\mathbb{R}\)) include the rational numbers, which are all numbers that can be represented in the form \(\frac{p}{q}\), and the <i>irrational</i> numbers, all of the numbers that are too cool for school, like \(\pi\), \(\varphi\), and \(\sqrt{2}\). It <i>does not</i> include, however, what we call <i>imaginary</i> numbers: numbers that include an imaginary part, \(i\), the <i>imaginary unit</i>, which is defined as the $\sqrt{-1}. <i>Imaginary</i>, because it's not a real number, and <i>unit</i>, because it serves the same purpose on the imaginary axis as 1 on the real axis. A <i>complex number</i>, is an ordered pair \((a, b)\), where \(a, b \in \mathbb{R}\), and written as \(a + bi\), where \(i\) is again that imaginary part. We denote the set of all complex numbers with \(\mathbb{C}\). We define \(\mathbb{F}\) as either \(\mathbb{R}\) or \(\mathbb{C}\)<br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Amitav Krishna</p>
<p class="date">Created: 2025-10-19 Sun 18:00</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
